{

    "app": {
        "par1": "Navigation console"
    },

    "terminal": {
        "par1": "Welcom to yvesnf.dev v0.1.",
        "par2": "This is the system console:",
        "par3": "use --help to see options.",
        "par4": "--help",
        "par5": "Available commands:",
        "par6": "comand:",
        "par7": "Unrecognized command: use",
        "availablePages": ["home", "biography", "education", "experience", "technologies"]
    },

    "home": {
        "developer": "#developer",
        "frontEnd": "#front-end"
    },

    "bio": {
        "title": "Bio",
        "bio_par1": "First of all, I want to tell you that it is a pleasure for me to have you browsing into this system. Now let me introduce myself:",
        "bio_par2": "My name is Yves Navarro, I was born in '87 and I am a programmer, developer or whatever you call this profession. For a while I have been trying to focus myself into the Front-end area, the truth is that I like to fiddle with modern Javascrip frameworks and I feel very comfortable using this technology. I also have Back-end experience developing REST APIs in C# along with SQL SERVER databases, but, I wouldn't dare say that I am Full-Stack in any technology because first of all, I have spent much of the time in the last years developing code into the front with AngularJS and secondly because I think that to call yourself Full-Stack, you have to be very sure of it and that is why today I am striving to expand my knowledge to a level that allows me to be able to say that I am Full-Stack in some set of technologies in a safely way.",
        "bio_par3": "As you have seen, I have developed this website so that it transmits a retro look & feel using styles, fonts and other things so on as if we were using an old terminal because my passion for technology was started when my parents brought our first computer at home, and it was a machine with an Windows 98 with which I spent many hours carrying out small experiments and this website has been a good excuse to be able to pay a small tribute to that time of my life that marked me so much. Oh, by the way, I think that the movies of the late 80s and early 90s like Terminator 2, War Games, Back to the Future and a long etcetera that I saw as a child, also has something to do with the fact what today I like everything that has a retro-geek feel :)"
    },

    "education": {
        "title": "Education",
        "job1": {
            "title": "[from 2018 to today] - Computer Engineering Degree",
            "desc": "Currently I am studying this degree remotely through the UOC and I am going without haste but without pause."
        },
        "job2": {
            "title": "[from 2014 to 2015] - CFGS Web applications development",
            "desc": "I studied this higher level training cycle in Amposta (Tarragona) because I wanted to focus my professional career towards programming. I was able to validate the first year with ASIX studies and then I was able to finish the cycle in one year."
        },
        "job3": {
            "title": "[from 2011 to 2013] - CFGS Computer systems and networks administration",
            "desc": "I studied this higher level training cycle in Amposta (Tarragona). I have a good memories of that time of study, because I learned to use Linux systems and for this reason today I am a huge fan of these systems."
        }
    },

    "experience": {
        "title": "Experience",
        "experience1": {
            "title": "[from 2106 until today] - DISI Sistemas Informáticos",
            "desc": "In DISI I have been working mainly in the Front-End area developing applications and/or WebApps of all kinds using AngularJS and Material Design (AngularJS Material Framework). I have also used C# to develop API's Rest and SQL Server to design and build the databases."
        }
    },

    "technologies": {
        "title": "Technologies",
        "par1": "As for technologies, lately I am using my free time learning modern Javascript frameworks. Between 2019 and into the beginning of 2020 I have been very focused on Angular 8 and I have also had the pleasure of starting to tinker with Google Firebase.",
        "par2": "Into my plans for this 2020 are to start to learn Node.js and React.js, so I hope to put their respective icons below soon :)",
        "par3": "Well, here is a small list of the most relevant technologies that I use and/or know about:"
    }

}